Revit 2027 API
NumberingSchema.GetSchemasInDocument Method
 Returns a set of Ids of all Numbering Schema elements for a given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetSchemasInDocument(
	Document document
)
Public Shared Function GetSchemasInDocument (
	document As Document
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetSchemasInDocument(
	Document^ document
)
static member GetSchemasInDocument :
        document : Document -> ISet<ElementId>
Parameters
document Document
 A document to get numbering schema from.
Return Value
ISet<ElementId>
 Ids of NumberingSchema elements. An empty set if no schemas are found in the given document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace